In [1]:
# Now lets create new database using the code make share you have enable xampp
# you can just copy the code
import mysql.connector
#importing database from our system
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password=""
)
db = database.cursor() 


db.execute("CREATE DATABASE pythons8am")

In [5]:
import mysql.connector
#importing database from our system
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "python8am"
)
db = database.cursor() 


db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 89, 78, 90, 72, 412, 79.0, 'B')
(2, 'Hari', 83, 89, 78, 90, 72, 416, 80.0, 'A')

In [3]:
db.execute("SELECT Sn,name,total FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 412)
(2, 'Hari', 416)

In [6]:
db.execute("SELECT * FROM student WHERE grade='A'")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Hari', 83, 89, 78, 90, 72, 416, 80.0, 'A')

In [11]:
sql = "INSERT INTO student (Sn, name, physics, chemistry, math, english, nepali, total, per, grade) VALUES (5, 'Nabin', 78, 89, 78, 67, 72, 400, 75, 'B')"
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted.")

1 record inserted.

In [13]:
n = int(input("Enter n = "))
for i in range(1,n+1):
    name = input("Enter name = ")
    physics = int(input("Enter physics = "))
    chemistry = int(input("Enter chemistry = "))
    math = int(input("Enter math = "))
    english = int(input("Enter english = "))
    nepali = int(input("Enter nepali = "))
    total = sum([physics,chemistry,math,english,nepali])
    per = total/5
    if per >= 80:
        grade = 'A'
    elif per >=60:
        grade = 'B'
    elif per >= 50:
        grade = 'C'
    else:
        grade = 'F'
        
    sql = f"INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade) VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')"
    db.execute(sql)
    database.commit()

Enter n = 2
Enter name = Nabina
Enter physics = 89
Enter chemistry = 78
Enter math = 87
Enter english = 67
Enter nepali = 87
Enter name = Shyama
Enter physics = 78
Enter chemistry = 45
Enter math = 98
Enter english = 78
Enter nepali = 67

In [14]:
db.execute("SELECT * FROM student WHERE total > 400")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 89, 78, 90, 72, 412, 79.0, 'B')
(2, 'Hari', 83, 89, 78, 90, 72, 416, 80.0, 'A')
(6, 'Nabina', 89, 78, 87, 67, 87, 408, 81.6, 'A')

In [15]:
# Update
sql = "UPDATE student SET name = 'Shyam' WHERE Sn = 7"
db.execute(sql)
database.commit()

In [16]:
# Delete
sql = "DELETE FROM student  WHERE Sn = 7"
db.execute(sql)
database.commit()